# x = 1
# c = 3.5
# v = -5

# name = 'Hello John'

# print(name.replace('Hello', 'Hi')) # replace - заменяет Hello на Hi



# is_true = True`


# print(max(x, c))
# min()
# print(abs(v)) - # возвращает положительное число

# print(len(name)) - количество букв

# print(len('hello')) 

# print(name.upper()) - # все буквы заглавные

# print(name.lower) - # все маленькие

# print(name.capitalize()) - # первая заглавная






#################################
# 1) Задача: Вывод приветствия с именем. Напишите программу, 
# которая запрашивает у пользователя его имя и выводит приветствие 
# в формате "Привет, [имя], как дела?".

# name = input('Введите Ваше имя: ')

# print('Привет', name, 'Как дела?')

##########################################


# 2)Задача: Расчет площади прямоугольника 
# Напишите программу, которая запрашивает у пользователя длину и ширину прямоугольника, 
# а затем выводит его площадь.


# a = int(input('Введите длину прямоугольника: '))
# b = int(input('Введите ширину прямоугольника: '))

# print(a * b)

############################################

# 3)Задача: Конвертер температуры Напишите программу, которая принимает температуру 
# в градусах Цельсия от пользователя и выводит ее эквивалент в градусах Фаренгейта.


# temp1 = int(input('Введите градус в Цельсиях: '))
# a = (temp1 * 9/5 + 32)

# print(f'{a} градусов по Фаренгейту')

##################################

# 4)Задача: Вычисление среднего значения 
# Напишите программу, которая запрашивает у пользователя три числа, 
# # а затем выводит их среднее значение.

# a = int(input('Введите первое число: '))

# b = int(input('Введите второе число: '))

# c = int(input('Введите третье число: '))


# x = a + b + c

# print(x / 3)


############################

# 5)Задача: Калькулятор BMI (индекса массы тела) 
# Напишите программу, которая запрашивает у пользователя его вес (в килограммах) и рост (в метрах), 
# а затем вычисляет и выводит его индекс массы тела (BMI).

# a = int(input('введите вес в килограммах: '))
# b = float(input('введите рост в килограммах: '))

# x = b * 2

# print(a / x)

############################





# когда ставим знак // , то деление на целое число с округлением 


