
###########################################################################
# 1)Дан список слов который вводит пользователь. 
# Напишите программу, которая создает новый список, содержащий только уникальные слова из исходного списка.

# ВАРИАНТ 1
# a = {'Apple', 'Mango', 'Mango', 'Banana', 'Banana', 'Orange'}
# b = {'Car', 'Tank', 'Apple', 'Bike', 'Orange', 'Plane'}
# z = a.intersection(b) 
# print(z)

# ВАРИАНТ 2






###########################################################################

#  3)Напишите программу, которая принимает список слов от пользователя 
#  и выводит самое длинное слово в списке, используя функцию max() с параметром key=len.


# slovo_1 = input("Введите Ваше слово: ")

# slovo_2 = input("Введите еще слово: ")
# slovo_3 = input("Введите последнее слово: ")

# a = max(slovo_1, slovo_2, slovo_3, key=len)

# print("Самое длинное слово: ", a)




###########################################################################
#  4)  Напишите программу, которая принимает список чисел от пользователя 
#   и выводит сумму всех чисел, используя функцию sum().

num_1 = int(input("Введите число: "))
num_2 = int(input("Введите еще число: "))
num_3 = int(input("И последнее: "))
a = sum(num_1, num_2, num_3)

print("сумма всех введенных2 чисел: ", a)

words = input("Nums: ").split
words = int()




###########################################################################

# 5)  Напишите программу, которая принимает список слов от пользователя 
#  и выводит список слов в обратном порядке, используя метод reverse().

# slovo_1 = input("Введите Ваши слова: ").split()

# slovo_1.reverse()
# print(slovo_1)