# a = 'HelloWorld'

# print(a.title())
# print(a.upper())



#################################################################################

# БОЛЕЕ СЛОЖНЫЕ ТИПЫ ДАННЫХ: 

# СПИСКИ:
# # list - [] - # изменяемый
# a = ['Apple', "AAPLE", 'Malon', 'orange']
# a2 = []



# a.append('water')


# a.remove()
# print(a)


# a2 = a.copy()
# print(a2)



#################################################################################
# КОРТЕЖИ:
# # tuple () - # неизменяемый
# b = ('Apple', 'Malon', 'orange')



# index = b.index('Malon') - узнаешь какой у данного элемента индекс
# print(index)



# b.clear() - # не сможет очистить, так как кортеж нельзя изменить
# print(b)



# count = b.count('Malon') - показывает сколько таких элементов имеется
# print(count)



#################################################################################
# СЛОВАРИ: 

# # dict {} - # изменяемый
# c = {'Apple': 2, 'Malon': 1, 'Jhon': 'Constantin', 'keys': [1, 2, 3, 4, 5]}


# keys = c.keys() - выводит только ключи
# print(keys)


# values = c.values() # выводит только значения
# print(values)


# items = c.items() # выводит все элементы но в списках
# print(items)


# name = c.get('Apple') - # выводит значение данного ключа
# print(name)


# name = c.pop('Jhon') # - удаляет элемент 
# print(name)


# c.clear() # - очищает список, работает со списком, словарем и множествами 
# print(c)




#################################################################################
# МНОЖЕСТВА:

# # # set {} - # изменяемый (каждый элемент уникален)
# x = {'Apple', 'Malon', 'orange'}


# x.add("water") - добавляет множесто в элемент
# print(x)


# a.sort() # - просто сортирует беспорядочно
# print(a)








#______________________________________________
# fruits = ['apple', 'banana', 'cherry']

# fruits.reverse() - # переворачивает 

# print(fruits)
# ______________________________________________



# ______________________________________________
# fruits = ["apple", "banana", "cherry"]

# fruits.append("orange")

# print(fruits)
# ______________________________________________







