# ГЕНЕРАТОРЫ СПИСКА

# range(start:stop:step) - функция генерации чисел



#    1)Создать словарь, где ключами будут числа от 1 до 5, а значениями будут их кубы.

# i = []

# value = {i**3 for i in range(1, 6)}

# print(value)


#  2) Создать список из первых букв каждого слова в строке word = “Hello how are you”

# word = "Hello how are you"
# word = word.split()
# z=[i[0] for i in word]
# print(z)



# #   3)Создать список длин слов в строке, пропуская пустые слова.

# sentence = "Hello i am good and you , so what is your name"

# num = [len(i) for i in sentence.split() if i != ',']

# print(num)



